In [1]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({'key': ['a', 'b', 'c', 'd', 'e'],
                    'A1': range(5), 
                    'B1':range(5,10)})

df2 = pd.DataFrame({'key': ['a', 'b', 'c'], 
                    'A2': range(3), 
                    'B2':range(3,6)})

In [4]:
df1

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [5]:
df2

  key  A2  B2
0   a   0   3
1   b   1   4
2   c   2   5

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   key     5 non-null      object
 1   A1      5 non-null      int64
 2   B1      5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   key     3 non-null      object
 1   A2      3 non-null      int64
 2   B2      3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [11]:
pd.merge(df1, df2, how = 'inner', on='key')[['key', 'A1']]

  key  A1
0   a   0
1   b   1
2   c   2

In [10]:
pd.merge(df1, df2, how = 'inner', on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [12]:
type(np.nan)

float

In [16]:
pd.merge(df1, df2, how = 'left', on='key')[['B2']]

    B2
0  3.0
1  4.0
2  5.0
3  NaN
4  NaN

In [14]:
pd.merge(df1, df2, how = 'right',on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5